title: Suspicious Certutil Usage
id: 9cfa2f9c-1d8b-4a87-a6a0-123456789abc
status: experimental
description: Detects suspicious Certutil usage often associated with LOLBins.
author: Agata Gabara
date: 2026-07-01

references:
  - https://attack.mitre.org/techniques/T1218/

tags:
  - attack.defense_evasion
  - attack.t1218

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: '\certutil.exe'
    CommandLine|contains:
      - '-urlcache'
      - '-decode'
      - '-encode'
      - '-split'

  condition: selection

falsepositives:
  - Certificate administration
  - PKI maintenance

level: high