title: Suspicious PowerShell Execution With ExecutionPolicy Bypass
id: b1d7d8b3-4d11-4b7a-a5f4-001122334455
status: experimental
description: Detects PowerShell executed with ExecutionPolicy Bypass.
author: ag48665
date: 2026-07-01

references:
  - https://attack.mitre.org/techniques/T1059/001/

tags:
  - attack.execution
  - attack.t1059.001

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: '\powershell.exe'
    CommandLine|contains: '-ExecutionPolicy Bypass'

  condition: selection

falsepositives:
  - Administrative scripts
  - IT automation

level: medium