title: Suspicious Rundll32 Execution
id: 5d6c0a9a-3d85-4d77-ae9a-123456789001
status: experimental
description: Detects suspicious use of rundll32.exe.
author: ag48665
date: 2026-07-01

references:
  - https://attack.mitre.org/techniques/T1218/011/

tags:
  - attack.defense_evasion
  - attack.t1218.011

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: '\rundll32.exe'

  condition: selection

falsepositives:
  - Legitimate Windows components
  - Administrative tools

level: medium