title: Suspicious PowerShell Execution With Encoded Command
id: 2b3f4b16-1111-4444-9999-aaaaaaaaaaaa
status: experimental
description: Detects PowerShell execution using EncodedCommand or ExecutionPolicy Bypass.
author: Agata Gabara
date: 2026-07-01
references:
  - https://attack.mitre.org/techniques/T1059/001/
tags:
  - attack.execution
  - attack.t1059.001

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '\powershell.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-ExecutionPolicy Bypass'

  condition: selection

falsepositives:
  - System administrators
  - Automation scripts

level: medium